/*
Да се напише програма во која од тастатура се внесуваат непознат број мали
букви сѐ додека не се внесе знак што не е мала буква. За секој пар
последователни букви, во нов ред треба да се испечати секвенца од буквите во                                      
абецеден редослед што се наоѓаат меѓу нив (без нив) проследено со вкупниот
број на вакви букви. Секогаш печатењето се почнува од буквата што се наоѓа
понапред во азбуката кон таа што е поназад. Ако парот букви е составен од две
соседни букви во азбуката, не се печати ништо. На крај да се испечати
вкупниот број на испечатени секвенци од букви.
*/
#include <stdio.h>
#include <math.h>

int main(){
    char c,prev,start,end;
    int first=1,i=0,j;
    while(1){
        scanf("%c", &c);
        if(c<'a' && c>'z'){
            break;
        }
        if(first){
            first=0;
        }else if(abs(c-prev)==1){
            prev=c;
            continue;
        }else{
            if(prev>c){
                start=c+1;
                end=prev-1;
            }else{
                start=prev+1;
                end=c-1;
            }
            for(j=0;start<=end;start++){
                printf("%c", start);
                j++;
            }
            printf(" %d\n", j);
            i++;
        }
        prev=c;
    }
    printf("\n%d", i);
    return 0;
}