/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).
Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку 
не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

00 01 02        00 01 02 03         00 01 02
10 11 12        10 11 12 13         10 11 12
20 21 22        20 21 22 23
30 31 32        30 31 32 33
40 41 42        40 41 42 43

*/
#include <stdio.h>
#include <ctype.h>
#include <string.h>

int main(){
    int n,m,i,j,x,y;
    int a[100][100];
    scanf("%d %d", &n, &m);
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            scanf("%d", &a[i][j]);
        }
    }
    scanf("%d %d", &x, &y);
    int sum1=0,sum2=0,sum3=0,sum4=0;
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            if(i<x && j<y){
                sum2+=a[i][j];
            }
            if(i<x && j>=y){
                sum1+=a[i][j];
            }
            if(i>=x && j<y){
                sum3+=a[i][j];
            }
            if(i>=x && j>=y){
                sum4+=a[i][j];
            }
        }
    }
    printf("%d %d %d %d", sum1, sum2, sum3, sum4);
    return 0;
}