/*
Да се напише рекурзивна функција која што прима еден аргумент број x која што ќе враќа 1 доколку секоја цифра во бројот е помала од предходната, а во спротивно 0.
Пример бројот 54321 е опаѓачки, додека пак бројот 54123 не е опаѓачки број.
Од стандарден влез се вчитува прво број N, а потоа N броеви. За секој број да се испечати 1 или 0 (во нов ред), доколку бројот е опаѓачки или не е опаѓачки.
*/

#include <stdio.h>
#include <math.h>
#include <ctype.h>

int isLowering(int n){//54321
    if(n/10==0){
        return 1;
    }
    if(n%10>=(n/10)%10){
        return 0;
    }
    isLowering(n/10);
}

int main(){
    int N,a;
    scanf("%d", &N);
    for(int i=0;i<N;i++){
        scanf("%d", &a);
        printf("%d \n", isLowering(a));
    }
    return 0;
}