/*
Да се напише програма во која во даден опсег на природни броеви [m,n], 
ќе се најдат и отпечатат во нов ред сите броеви за кои важи дека збирот 
на бројот со неговата слика(број кој ги има истите цифри, но во обратен 
редослед) е помал или еднаков на двојната вредност на бројот. На крај да 
се отпечати и бројот на вакви броеви.
*/  
#include <stdio.h>

int main(){
    int m,n,tmp,cnt=0;
    scanf("%d %d", &m, &n);
    for(int i=m;i<=n;i++){
        tmp=i;
        int nov=0;
        while(tmp>0){
            nov=nov*10 + tmp%10;
            tmp/=10;
        }
        if(i+nov<=2*i){
            printf("%d\n", i);
            cnt++;
        }
    }
    printf("Vkupno: %d", cnt);
    return 0;
}