/*
Од тастатура се внесува цел број n, а потоа и n тројки природни броеви
(должини на три отсечки). За секоја тројка должини треба да се испечати
порака Moze ако со нив може да се конструира триаголник, во спротивно се
печати Ne moze. На крај да се испечати редниот број на тројката броеви со која
се конструира триаголникот со најголем периметар (се земаат предвид само
тројките со кои може да се конструира триаголник), како и вредноста на
најголемиот периметар. Ако постојат повеќе такви тројки броеви, да се
испечати редниот број на последната. Се смета дека првата внесена тројка е со
реден број еден, втората со реден број два итн.
*/
#include <stdio.h>

int main(){
    int n,a,b,c,maxL=0,maxi=1;
    scanf("%d", &n);
    for(int i=1;i<=n;i++){
        int L=0,indeks=1;
        scanf("%d %d %d", &a, &b, &c);
        if(a+b>c && b+c>a && a+c>b){
            printf("Moze\n");
            L=a+b+c;
            if(L>=maxL){
                maxL=L;
                maxi=i;
            }
        }else{
            printf("Ne moze\n");
            continue;
        }
    }
    printf("Najgolem perimetar: %d, reden broj %d", maxL, maxi);
    return 0;
}