/*
Од стандарден влез се чита цел број N. Потоа се вчитуваат N низи од цели броеви (со максимална должина од 100 
елементи), при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата.
Да се напише програма која за секоја низа ќе го испечати процентот на огледални еднакви броеви во низата.
 Огледални броеви во низа се првиот и последниот, вториот и претпоследниот итн. Доколку низата има непарен 
 број на елементи, средниот елемент е и огледален и еднаков.
*/
#include <stdio.h>

int main(){
    int N;
    scanf("%d", &N);
    for(int i=0;i<N;i++){
        int n,a[100];
        scanf("%d", &n);
        for(int j=0;j<n;j++){
            scanf("%d", &a[j]);
        }
        int cnt=0;
        for(int j=0;j<n/2;j++){
            if(a[j]==a[n-j-1]){
                cnt++;
            }
        }
        if(n%2==0){
            printf("%.2f%% \n", ((cnt*2.0)/n)*100.0);
        }else{
            printf("%.2f%% \n", ((cnt*2.0+1)/n)*100);
        }
    }
    return 0;
}