/*
Од стандарден влез се чита позитивен непарен број n (n е најмалку 3) кој ги дава димензиите на квадратната 
матрица од цели броеви, која се чита во продолжение. Да се напише програма која од таа матрица(макс. 100 x 100) 
ќе креира нова матрица 2 x 2, која ќе ги има за елементи збировите на елементите на регионите на првата матрица, 
соодветно. Во продолжение на сликата може да видиме како се добиваат регионите за матрица кога n = 5.
*/
#include <stdio.h>

int main(){
    int N,i,j;
    scanf("%d", &N);
    int a[100][100], b[2][2];
    for(i=0;i<N;i++){
        for(j=0;j<N;j++){
            scanf("%d", &a[i][j]);
        }
    }
    for(i=0;i<N;i++){
        for(j=0;j<N;j++){
            if(i<N/2 && j<N/2){
                b[0][0]+=a[i][j];
            }
            if(i<N/2 && j>N/2){
                b[0][1]+=a[i][j];
            }
            if(i>N/2 && j<N/2){
                b[1][0]+=a[i][j];
            }
            if(i>N/2 && j>N/2){
                b[1][1]+=a[i][j];
            }
        }
    }
    for(i=0;i<2;i++){
        for(j=0;j<2;j++){
            printf("%d ", b[i][j]);
        }
        printf("\n");
    } 
    return 0;
}