/*
Од стандарден влез се чита позитивен број n кој ги дава димензиите на квадратна матрица од цели броеви,
која се чита во продолжение. Да се напише програма која за таа матрица(макс. 100 x 100) ќе ја испечати 
должината на најдолгата строго растечка подниза, доколку матрицата ја гледаме ред по ред.
*/
#include <stdio.h>

int main(){
    int n,max=0;
    scanf("%d", &n);
    int a[100][100];
    for(int i=0;i<n;i++){
        for(int j=0;j<n;j++){
            scanf("%d", &a[i][j]);
        }
    }
    for(int i=0;i<n;i++){
        int cnt=1;
        for(int j=0;j<n;j++){
            if(a[i][j]==a[i][j+1]-1){
                cnt++;
            }else{
                cnt=1;    
            }
            if(cnt>max){
                max=cnt;
            }
        }

    }
    printf("%d", max);
    return 0;
}