/*
Да се напише програма во која се вчитува матрица (со димензии M и N, 1 < M,N <= 100) од цели броеви.
Сите елементи од матрицата се поставени на вредност 0 или 1.
Да се формира нова матрица така што на местото на сите елементи што имаат вредност 0, треба да се смести бројот 
на елементи со вредност 1 околу тој елемент во сите осум насоки.
Новодобиената матрица да се отпечати на стандарден излез, при што наместо елементите со вредност 1 од оригиналната матрица ќе се отпечати знак *.
00 01 02
10 ij 12
20 21 22
*/
#include <stdio.h>


int main(){
    int M, N, i, j;
    int mat[100][100],mat2[100][100];
    scanf("%d %d", &M, &N);
    for(i=0;i<M;i++){
        for(j=0;j<N;j++){
            scanf("%d ", &mat[i][j]);
        }
    }
    for(int i=0;i<M;i++){
        for(int j=0;j<N;j++){
            if(mat[i][j]==0){
                int cnt=0;
                for(int k=-1;k<=1;k++){                         
                    for(int s=-1;s<=1;s++)
                        if(mat[i+k][j+s]==1){   
                            cnt++;
                        }
                }
                mat2[i][j]=cnt;
            }else{
                mat2[i][j]='*';
            }   
        }
    }
     for(i=0;i<M;i++){
        for(j=0;j<N;j++){
            if(mat2[i][j]==42){
                printf("* ");
            }else{
                printf("%d ", mat2[i][j]);
            }
        }
        printf("\n");
    }
    return 0;
}