/*
Да се напише програма која за даден број К ќе дешифрира која буква во латинската азбука се појавува 
после К букви од почетната буква C. К може да биде поголемо од бројот на букви во азбуката, при што 
броењето ќе продолжи од почеток (циклично). Се земаат во предвид само големи букви. На влез се читаат 
C и К, а на излез се печати дешифрираната буква. Задачата да се реши користејќи низа за големите букви 
од латинската азбука и при дешифрирање да се користат стандардните операции за низи.
*/
#include <stdio.h>
#include <ctype.h>
#include <math.h>

int main(){
    int K;
    char C;
    scanf("%c %d ", &C, &K);
    if(K>26){
        K-=(K/26)*26;
    }
    if(K>'Z'-C){
        K=K-('Z'-C);
        printf("%c", 'A'+K-1);
    }else{
        printf("%c", C+K);
    }
    return 0;
}