/*
За дадена низа од N големина, исчитајте ја истата и потоа:

Испечатете ја во нејзината оригинална форма
Сменете го распоредот на низата во обратна насока
Отстранете го секој втор член
Повторно сменете го распоредот на низата во обратна насока
За секоја од овие промени испечатете ја низата. За целосни поени работете само со една низа.
*/
#include <stdio.h>

int main(){
    int N;
    scanf("%d", &N);
    int a[N],anov[N];
    for(int i=0;i<N;i++){
        scanf("%d", &a[i]);
    }
    for(int i=0;i<N;i++){
        printf("%d ", a[i]);
    }
    printf("\n");
    for(int i=0;i<N;i++){
        printf("%d ", a[N-i-1]);
    }
    printf("\n");
    for(int i=0;i<N;i++){
        if(i%2==0){
            printf("%d ", a[N-i-1]);
        }
    }
    printf("\n");
    for(int i=0;i<N;i++){
        if(N%2==0){
            if(i%2!=0){ 
                printf("%d ", a[i]);
            }
        }else{
            if(i%2==0){ 
                printf("%d ", a[i]);
            }
        }

    }
    return 0;
}
