/*
Да се креира програма која што за вчитан датум од стандарден влез (во формат DD MM GGGG) 
ќе испечати на стандарден излез порака DA или NEво зависност од тоа дали внесениот датум 
е правилен или не.
При одредување на валидноста на датумот во предвид да се земат сите фактори:
дали месецот е број помеѓу 1 и 12
дали денот одговара со бројот на денови во тој месец
доколку е 29.02. да се внимава дали станува збор за престапна година
престапна година е секоја година која што е делива со 400 или пак е делива со 
4, но не и со 100.
*/
#include <stdio.h>

int main(){
    int day,month,year;
    scanf("%d %d %d", &day, &month ,&year);
    if(month>0 && month<=12){
        switch(month){
            case 1:
            case 3:
            case 5:
            case 7:
            case 8:
            case 10:
            case 12:
                if(day>0 && day<=31){
                    printf("DA");
                }else{
                    printf("NE");
                }
                break;
            case 2:
                if(day==29 && (year%400==0 || (year%4==0 && year%100!=0))){
                    printf("DA");
                }else{
                    printf("NE");
                }
                break;
            default:
                if(day>0 && day<=30){
                    printf("DA");
                }else{
                    printf("NE");
                }
        }
    }else{
        printf("NE");
    }
    return 0;
}