/*
Да се напише рекурзивна функција f() која за даден природен број ќе го пресмета и враќа збирот на сите цифри кои се наоѓаат на парни позиции (гледано од десно кон лево). 
Се смета дека најмалку значајната цифра е на 1-ва позиција. Потоа да се напише програма која за даден природен број n (што се внесува од тастатура) ќе ја повика функцијата 
f() за да го испечати збирот на цифрите кои се наоѓаат на парни позиции во n.
*/

#include <stdio.h>
#include <math.h>
#include <ctype.h>

int main(){
    int n;
    scanf("%d", &n);
    
    return 0;
}