/*
Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). 
Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
*/

#include <stdio.h>
#include <ctype.h>
#include <string.h>


int main(){
    int redsum,i,j,x,n,m;
    scanf("%d %d %d", &x, &n, &m);
    int a[100][100];
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            scanf("%d", &a[i][j]);
        }
    }
    for(i=0;i<n;i++){
        redsum=0;
        for(j=0;j<m;j++){
            redsum+=a[i][j];
        }
        for(j=0;j<m;j++){
            if(redsum>x){
                a[i][j]=1;
            }
            if(redsum<x){
                a[i][j]=-1;
            }
            if(redsum==x){
                a[i][j]=0;
            }
        }
    }
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }
    return 0;
}