/*
Да се напише програма која вчитува матрица со димензии MxN (макс. 100x100). На почетокот се внесуваат димензиите на матрицата, а потоа и елементите на матрицата кои се само вредностите 1 и 0. 
Програмата треба да изброи и отпечати на СИ во колку од редиците и колоните има барем 3 последователни елементи со вредност 1.
*/
#include <stdio.h>
#include <ctype.h>
#include <string.h>

int main(){
    int n,m,i,j;
    int a[100][100];
    scanf("%d %d", &n, &m);
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            scanf("%d", &a[i][j]);
        }
    }
    int cnt=0;
    for(i=0;i<n;i++){
        for(j=0;j<m;j++){
            if(a[i][j]==1){
                if(a[i][j+1]==1 && a[i][j+2]==1){
                    cnt++;
                    break;
                }
            }
        }
    }
    for(j=0;j<m;j++){
        for(i=0;i<n;i++){
            if(a[i][j]==1){
                if(a[i+1][j]==1 && a[i+2][j]==1){
                    cnt++;
                    break;
                }
            }
        }
    }
    printf("%d", cnt);
    return 0;
}