/*
Од стандарден влез се чита еден природен број n. Меѓу природните броеви помали од n, да се најде оној 
чиј што збир на делителите е најголем. Во пресметувањето на збирот на делителите на даден број, да не 
се зема предвид самиот број.
*/
#include <stdio.h>

int main(){
    int n,i,max=0,maxnum;
    scanf("%d", &n);
    for(i=n-1;i>1;i--){
        int sum=0;
        for(int j=1;j<i;j++){
            if(i%j==0){
                sum+=j;
            }
        }
        if(sum>max){
            max=sum;
            maxnum=i;
        }
    }
    printf("%d", maxnum);
    return 0;
}