/*
Во градот постојат 2 такси компании. Едната наплаќа фиксна цена C денари за 
првите К километри, а за секој нареден километар наплаќа уште P денари. Другата 
такси компанија има возила кои возат со брзина V километри во минута, а наплаќа 
B денари пред почетокот на возењето, за секој извозен километар уште D денари и 
дополнително за секоја минута возење наплаќа М денари. Ваша задача е за даден број 
на километри до дестинацијата да пресметате со која такси компанија најмногу ви се 
исплати да се возите.
Влез: Во првата линија е даден бројот на километри до дестинацијата. 
Во наредната линија се дадени C, K и P. Во третата и последна линија 
се дадени V, B, M и D.
Излез: Во првиот ред се печатат цените на двете компании одвоени со 
празно место, а во вториот ред се печати 1 доколку цената за возење 
со првата компанија е помала или еднаква на цената на возење со втората 
компанија, се печати 0 инаку.
*/
#include <stdio.h>

int main(){
    int C,K,P,V,B,M,D,km,pFirst,pSecond;
    scanf("%d\n%d %d %d\n%d %d %d %d", &km, &C, &K, &P, &V, &B, &M, &D);
    pFirst=C +(km-K)*P;
    pSecond=B+(km*D)+(km/V)*M;
    printf("%d %d\n", pFirst, pSecond);
    if(pFirst<=pSecond){
        printf("1");
    }else{
        printf("0");
    }
    return 0;
}