/*
Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
индекс (шестцифрен цел број)
шест оценки од последниот семестар кој го слушал
Да се напише програма која што на стандарден излез ќе ги испечати следните 
информации за студентот: (погледнете во тест примерите за форматот на печатење)
просек на студентот
просекот да се испечати со точност од 3 децимали
година на студии
студентите чијшто индекс почнува на 17 се трета година, на 16 се четврта 
година, на 15 се петта година итн.
дали е награден (1 = награден, 0 = не е награден)
Еден студент се наградува доколку има просек еднаков или поголем од 9.5
*/
#include <stdio.h>

int main(){
    int index, a,b,c,d,e,f;
    float average;
    scanf("%d %d %d %d %d %d %d", &index, &a,&b,&c,&d,&e,&f);
    average=(a+b+c+d+e+f)/6.0;
    printf("Prosek: %.3f", average);
    printf("\nStudent: %d\n", index);
    for(int i=19;i>0;i--)
            if((index/10000)==i){
                printf("%d godina\n", 20-i);
            }
    if(average>=9.5){
        printf("Nagraden: %d", 1);
    }else{
        printf("Nagraden: %d", 0);
    }
    return 0;
}
