/*
Пресметајте ја цената за електрична енергија која еден корисник треба да 
ја плати, во зависност од тоа колку kWh потрошил. За помалку 500 kWh се 
наплаќа 5 ден/kWh. Ако трошокот ја надмине оваа граница, тогаш за наредните 
150 kWh се наплаќа 7.5 ден/kWh, за наредните 200 kWh се наплаќа 11 ден/kWh, 
а за секој трошок над тоа се доплаќа уште 13.5 ден/kWh. На крајот на сметката 
се додава 10% ДДВ доколку изнесува 7000 денари или помалку, додека ако изнесува 
повеќе од тоа, се додава 18% ДДВ.
*/
#include <stdio.h>

int main(){
    int use;
    float bill;
    scanf("%d", &use);
    if(use<=500){
        bill=use*5;
    }else if(use>500 && use<=650){
        bill=500*5 + (use-500)*7.5;
    }else if(use>650 && use<=850){
        bill=500*5 + 150*7.5 + (use-650)*11;
    }else if(use>850){
        bill=500*5 + 150*7.5 + 200*11 + (use-850)*13.5;
    }
    if(bill<=7000){
        bill+=bill*0.1;
    }else{
        bill+=bill*0.18;
    }
    printf("%.2f", bill);
    return 0;
}