/*
Eден природен e „интересен“ ако неговиот обратен број е делив со неговиот број на цифри. Обратен број е 
бројот составен од истите цифри, но во обратен редослед (на пример, 653 е обратен број на бројот 356). 
Од тастатура се внесува природен број n ( n > 9). Да се најде и отпечати најголемиот природен број помал 
од n кој што е „интересен“. Ако внесениот број не е валиден, да се отпечати соодветна порака (Brojot ne e validen).
*/
#include <stdio.h>

int main(){
    int n;
    scanf("%d", &n);
    if(n<=9){
        printf("Brojot ne e validen");
        return 0;
    }
    n-=1;
    while(n>0){
        int tmp=n,nov=0,cnt=0;
        while(tmp>0){
            nov=nov*10+tmp%10;
            cnt++;
            tmp/=10;
        }
        if(nov%cnt==0){
            printf("%d",n);
            return 0;
        }
        n--;
    }
    return 0;
}