/*
Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот 
редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.
Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)
*/
#include <stdio.h>

int main(){ 
    int a,b,max,min;
    scanf("%d %d", &a, &b);//12345678|1357
    if(a*b!=0 && a>0 && b>0){//int overflow imashe za a*b>0...
        if(a<b){
            min=a;
            max=b;
        }else{
            min=b;
            max=a;
        }
        while(max>0){
            if(min%10==(max/10)%10){
                max/=100;
                min/=10;
                continue;
            }else{
                printf("NE");
                return 0;
            }
            min/=10;
            max/=100;
        }
        printf("PAREN");
    }else{
        printf("Invalid input");
    }
    return 0;
}