/*
Да се напише програма која што од стандарден влез ќе вчитува 3 знаци 
и истите ќе ги шифрира во две секвенции од бинарни броеви (1/0) со должина 3.
Шифрирањето треба да се одвива на следниот начин:
во првата бинарна секвенца, за секој еден знак да се испечати 0 
доколку знакот е некој специјален знак, а 1 во спротивно.
во втората бинарна секвенца, за секој еден знак да се испечати 0 
доколку знакот е буква, а 1 во спротивно.
*/
#include <stdio.h>

int main(){
    char a,b,c;
    scanf("%c %c %c", &a, &b, &c);
    if((a>=48&&a<=57)||(a>=65&&a<=90)||(a>=97&&a<=122))
        printf("1");
    else
        printf("0");
    if((b>=48&&b<=57)||(b>=65&&b<=90)||(b>=97&&b<=122))
        printf("1");
    else
        printf("0");
    if((c>=48&&c<=57)||(c>=65&&c<=90)||(c>=97&&c<=122))
        printf("1");
    else
        printf("0");
    printf("\n");
    if((a>=65&&a<=90)||(a>=65&&a<=122))
        printf("0");
    else
        printf("1");
    if((b>=65&&b<=90)||(b>=65&&b<=122))
        printf("0");
    else
        printf("1");
    if((c>=65&&c<=90)||(c>=65&&c<=122))
        printf("0");
    else
        printf("1");
    return 0;
}
